{"class_name": "Model", "config": {"name": "discriminator", "layers": [{"name": "discriminator_data_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 96000, 2], "dtype": "float32", "sparse": false, "name": "discriminator_data_input"}, "inbound_nodes": []}, {"name": "discriminator_c1", "class_name": "Conv1D", "config": {"name": "discriminator_c1", "trainable": true, "filters": 4, "kernel_size": [48], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["discriminator_data_input", 0, 0, {}]]]}, {"name": "discriminator_c2", "class_name": "Conv1D", "config": {"name": "discriminator_c2", "trainable": true, "filters": 8, "kernel_size": [48], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["discriminator_c1", 0, 0, {}]]]}, {"name": "discriminator_c3", "class_name": "Conv1D", "config": {"name": "discriminator_c3", "trainable": true, "filters": 16, "kernel_size": [48], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["discriminator_c2", 0, 0, {}]]]}, {"name": "discriminator_p1", "class_name": "MaxPooling1D", "config": {"name": "discriminator_p1", "trainable": true, "strides": [480], "pool_size": [480], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["discriminator_c3", 0, 0, {}]]]}, {"name": "discriminator_c4", "class_name": "Conv1D", "config": {"name": "discriminator_c4", "trainable": true, "filters": 4, "kernel_size": [48], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["discriminator_p1", 0, 0, {}]]]}, {"name": "discriminator_p2", "class_name": "MaxPooling1D", "config": {"name": "discriminator_p2", "trainable": true, "strides": [4], "pool_size": [4], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["discriminator_c4", 0, 0, {}]]]}, {"name": "discriminator_c5", "class_name": "Conv1D", "config": {"name": "discriminator_c5", "trainable": true, "filters": 8, "kernel_size": [48], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["discriminator_p2", 0, 0, {}]]]}, {"name": "discriminator_p3", "class_name": "MaxPooling1D", "config": {"name": "discriminator_p3", "trainable": true, "strides": [4], "pool_size": [4], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["discriminator_c5", 0, 0, {}]]]}, {"name": "discriminator_c6", "class_name": "Conv1D", "config": {"name": "discriminator_c6", "trainable": true, "filters": 4, "kernel_size": [48], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["discriminator_p3", 0, 0, {}]]]}, {"name": "discriminator_p4", "class_name": "MaxPooling1D", "config": {"name": "discriminator_p4", "trainable": true, "strides": [4], "pool_size": [4], "padding": "same", "data_format": "channels_last"}, "inbound_nodes": [[["discriminator_c6", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["discriminator_p4", 0, 0, {}]]]}, {"name": "discriminator_solution", "class_name": "Dense", "config": {"name": "discriminator_solution", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "input_layers": [["discriminator_data_input", 0, 0]], "output_layers": [["discriminator_solution", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}