{"class_name": "Model", "config": {"name": "generator", "layers": [{"name": "generator_x", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "generator_x"}, "inbound_nodes": []}, {"name": "generator_d1", "class_name": "Dense", "config": {"name": "generator_d1", "trainable": true, "units": 10, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["generator_x", 0, 0, {}]]]}, {"name": "generator_d2", "class_name": "Dense", "config": {"name": "generator_d2", "trainable": true, "units": 10, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["generator_d1", 0, 0, {}]]]}, {"name": "generator_d3", "class_name": "Dense", "config": {"name": "generator_d3", "trainable": true, "units": 10, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["generator_d2", 0, 0, {}]]]}, {"name": "generator_d4", "class_name": "Dense", "config": {"name": "generator_d4", "trainable": true, "units": 10, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["generator_d3", 0, 0, {}]]]}, {"name": "generator_d5", "class_name": "Dense", "config": {"name": "generator_d5", "trainable": true, "units": 19, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["generator_d4", 0, 0, {}]]]}, {"name": "generator_d6", "class_name": "Dense", "config": {"name": "generator_d6", "trainable": true, "units": 1920, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["generator_d5", 0, 0, {}]]]}, {"name": "generator_d7", "class_name": "Dense", "config": {"name": "generator_d7", "trainable": true, "units": 192000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["generator_d6", 0, 0, {}]]]}, {"name": "generator_fake", "class_name": "Reshape", "config": {"name": "generator_fake", "trainable": true, "target_shape": [-1, 2]}, "inbound_nodes": [[["generator_d7", 0, 0, {}]]]}], "input_layers": [["generator_x", 0, 0]], "output_layers": [["generator_fake", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}